esp-cpp/espp/components/switch2_pro/example/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32c6"

# Common ESP-related
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_FREERTOS_HZ=1000
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# Partition Table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# BT config: NimBLE only (the Switch 2 controller interface is BLE)
CONFIG_BT_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=n
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_LOG_LEVEL_NONE=y
CONFIG_BT_NIMBLE_NVS_PERSIST=y
CONFIG_BT_NIMBLE_GAP_DEVICE_NAME_MAX_LEN=100
CONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=8192

# NOTE: MAX_CCCDS should be 4 * MAX_BONDS
CONFIG_BT_NIMBLE_MAX_BONDS=3
CONFIG_BT_NIMBLE_MAX_CCCDS=128

# The Switch 2 console drives a 5 ms connection interval (below the BLE spec
# minimum). Stable input streaming additionally requires the opt-in NimBLE
# patch — enable it (RISC-V targets only) and understand the caveats:
# CONFIG_SWITCH2_PRO_PATCH_NIMBLE_5MS=y
